const catsFacts = [
    "Коти можуть здійснювати стрибки в 7 разів довжини свого тіла. Це означає, що якщо ваш кіт важить 4 кг і має довжину тіла 60 см, то він може стрибнути на відстань більше 4 метрів!",
    "Коти мають дуже гнучку хребет. У них є більше кісток у своїй хребтині, ніж у людей, що дозволяє їм виконувати неможливі для нас фізичні трюки.",
    "Коти дуже чутливі до запахів",
    "Коти дуже чутливі до запахів. Вони можуть розрізняти різні запахи й навіть розпізнавати своїх господарів за запахом.",
    "Коти можуть видавати понад 100 різних звуків. Вони вміють муркотіти, м’яукати, шипіти та багато інших звуків, щоб виразити свої почуття.",
    "Коти сплять більше ніж люди. Вони можуть спати від 12 до 16 годин на день!",
    "Коти мають гострі кігті, які допомагають їм ловити здобич та захищатися від ворогів. Але ці кігті можуть також бути шкідливими для меблів, якщо кіт буде їх точити.",
    "Коти здатні побачити в темряві. Вони мають великі зіниці, які допомагають їм збирати найменші кількості світла, щоби бачити в темряві.",
    "Кіт був мером міста на Алясці протягом 20 років",
    "Ісаак Ньютон винайшов двері для котів",
    "У 1963 році кіт полетів у космос",
    "Стародавні єгиптяни голили собі брови, коли їхні коти помирали",
];
const CatsFactsList = () =>{

    console.log('old array: ', catsFacts);
    console.log('new array: ', 
        catsFacts.map((facts) => facts.toUpperCase));

    return(
        <div>
            <h1>Факти про котів</h1>
            <ul className="">
            {
            catsFacts.map((item, index)=>(
                <li key={item}>
                    {index}. {item}
                </li>
            ))}
            </ul>
        </div>
        
    );
}
export default CatsFactsList